ONVIF-SIM/fakecamera/dis.xml

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:dn="http://www.onvif.org/ver10/network/wsdl"><s:Header><a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</a:Action><a:MessageID>9cb25122-5140-4158-8736-e378235faebb</a:MessageID><a:RelatesTo>uuid:e4be048f-92e6-4d71-a8f7-c17cb9eec6a1</a:RelatesTo><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To></s:Header><s:Body><d:ProbeMatches><d:ProbeMatch><a:EndpointReference><a:Address>urn:uuid:2bfaffd1-6a02-4394-9d26-816c9f6e0905</a:Address></a:EndpointReference><d:Types>dn:NetworkVideoTransmitter</d:Types><d:Scopes>onvif://www.onvif.org/name/Videonetics_Camera_Emulator onvif://www.onvif.org/auth/1 onvif://www.onvif.org/manufacturer/Videonetics onvif://www.onvif.org/hardware/VSaasEdgeBox onvif://www.onvif.org/location/Any onvif://www.onvif.org/profile/streaming onvif://www.onvif.org/type/IPv4</d:Scopes><d:XAddrs>http://172.21.64.16:7000/onvif/device_service</d:XAddrs><d:MetadataVersion>1</d:MetadataVersion></d:ProbeMatch></d:ProbeMatches></s:Body></s:Envelope>